app/views/games/finished.json.jbuilder

SELECT  "player_games".* FROM "player_games" WHERE "player_games"."game_id" = $1 AND "player_games"."player_id" = $2  ORDER BY "player_games"."id" ASC LIMIT 1  [["game_id", 6], ["player_id", 1]]
---
  json.score do
    json.score game.player_games.where(player_id: @player.id).first.score