app/views/games/show.json.jbuilder

SELECT  "player_games".* FROM "player_games" WHERE "player_games"."player_id" = $1 AND "player_games"."game_id" = $2  ORDER BY "player_games"."id" ASC LIMIT 1  [["player_id", 1], ["game_id", 2]]
SELECT "players".* FROM "players" INNER JOIN "player_games" ON "players"."id" = "player_games"."player_id" WHERE "player_games"."game_id" = $1  [["game_id", 1]]
---
  json.nick player.nick
  json.score player.player_games.where(game_id: @game.id).first.score