app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(login: create_params[:login])
    if @user.password == create_params[:password]
      @user.generate_authentication_token
      @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."login" = $1 LIMIT 1  [["login", "test"]]
UPDATE "users" SET "authentication_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["authentication_token", "ELW6R3PQp9/TjqI1XuUltpfe3n2o+IoVDJcTgMYU6iIAbvyluLMolWZffP1FhfHW9IOnHgGBRezLKtEZ8fhQvQ=="], ["updated_at", "2016-02-09 13:17:01.649967"], ["id", 1]]